Дипломная_работа/src/Documents/ВКМ_ЗаявкаКлиента/ВКМ_ЗаявкаКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ЗаявкаКлиента</name>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.ВКМ_Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Статус</name>
    <type>
      <types>EnumRef.ВКМ_СтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПланДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Ответственный</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ФактДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_Работы</name>
    <attributes>
      <name>ВКМ_Исполнитель</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ВидРаботы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Часы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Дипломная_работа/src/InformationRegisters/ВКМ_ИсторияСтатусовЗаявок/ВКМ_ИсторияСтатусовЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ИсторияСтатусовЗаявок</name>
  <attributes>
    <name>ВКМ_Статус</name>
    <type>
      <types>EnumRef.ВКМ_СтатусЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Ответственный</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаСобытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВКМ_Заявка</name>
    <type>
      <types>DocumentRef.ВКМ_ЗаявкаКлиента</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Дипломная_работа/src/Enums/ВКМ_СтатусЗаявки/ВКМ_СтатусЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СтатусЗаявки</name>
  <enumValues>
    <name>ВКМ_Новая</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_Выполнена</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_Закрыта</name>
  </enumValues>
</mdclass:Enum>

Дипломная_работа/src/Documents/ВКМ_ЗаявкаКлиента/ObjectModule.bsl
// ================================================================

// ВКМ: Модуль объекта документа ВКМ_ЗаявкаКлиента

// ================================================================



#Область ОписаниеПеременных



Перем ВКМ_НужноЗаписатьИсториюПослеЗаписи;

Перем ВКМ_СтатусДляИстории;



#КонецОбласти

       Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	// 1. Получаем то, что СЕЙЧАС лежит в базе данных
	СтарыйСтатус = ВКМ_ПолучитьСтатусИзБазы();
	
	// 2. Если документ новый — ставим статус "Новая"
	Если ЭтоНовый() И ВКМ_Статус = Неопределено Тогда
		ВКМ_Статус = Перечисления.ВКМ_СтатусЗаявки.ВКМ_Новая;
	КонецЕсли;

	// 3. ПРОВЕРКА ЛОГИКИ ПЕРЕХОДОВ
	Если СтарыйСтатус = Перечисления.ВКМ_СтатусЗаявки.ВКМ_Выполнена 
		И ВКМ_Статус = Перечисления.ВКМ_СтатусЗаявки.ВКМ_Новая Тогда
		
		Сообщить("Нельзя возвращать выполненную заявку в статус 'Новая'!");
		Отказ = Истина;
	КонецЕсли;

	Если СтарыйСтатус = Перечисления.ВКМ_СтатусЗаявки.ВКМ_Закрыта Тогда
		Сообщить("Заявка уже закрыта. Любые изменения запрещены!");
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#Область ОбработчикиСобытий



// ------------------------------------------------

// Значения по умолчанию

// ------------------------------------------------

//@skip-check module-structure-event-regions

Процедура ПриСозданииНаСервере()



// ВКМ_BEGIN: инициализация новой заявки

Если ВКМ_Статус = Неопределено Тогда

ВКМ_Статус = Перечисления.ВКМ_СтатусЗаявки.ВКМ_Новая;

КонецЕсли;

// ВКМ_END



КонецПроцедуры



// ------------------------------------------------

// Перед записью помечаем, нужно ли писать историю

// ------------------------------------------------

Процедура ПриЗаписи(Отказ, РежимЗаписи)



// ВКМ_BEGIN: контроль загрузки данных

Если ОбменДанными.Загрузка Тогда

Возврат;

КонецЕсли;

// ВКМ_END



// ВКМ_BEGIN: подготовка записи истории статусов

ВКМ_НужноЗаписатьИсториюПослеЗаписи = Ложь;

ВКМ_СтатусДляИстории = Неопределено;



СтарыйСтатус = ВКМ_ПолучитьСтатусИзБазы();



Если ЭтоНовый() Тогда



Если ВКМ_Статус = Неопределено Тогда

ВКМ_Статус = Перечисления.ВКМ_СтатусЗаявки.ВКМ_Новая;

КонецЕсли;



ВКМ_НужноЗаписатьИсториюПослеЗаписи = Истина;

ВКМ_СтатусДляИстории = ВКМ_Статус;



ИначеЕсли СтарыйСтатус <> ВКМ_Статус Тогда



ВКМ_НужноЗаписатьИсториюПослеЗаписи = Истина;

ВКМ_СтатусДляИстории = ВКМ_Статус;



КонецЕсли;

// ВКМ_END



КонецПроцедуры



// ------------------------------------------------

// После записи документа пишем историю (уже есть ссылка)

// ------------------------------------------------

Процедура ПриЗаписиПослеЗаписи(Отказ, РежимЗаписи)



Если ОбменДанными.Загрузка Тогда

Возврат;

КонецЕсли;



// ВКМ_BEGIN: запись истории после фактической записи документа

Если ВКМ_НужноЗаписатьИсториюПослеЗаписи Тогда

ВКМ_ЗаписатьИсториюСтатуса(ВКМ_СтатусДляИстории);

КонецЕсли;



ВКМ_НужноЗаписатьИсториюПослеЗаписи = Ложь;

ВКМ_СтатусДляИстории = Неопределено;

// ВКМ_END



КонецПроцедуры



#КонецОбласти



#Область СлужебныеПроцедурыИФункции



// ------------------------------------------------

// Получить статус из базы (для сравнения при записи)

// ------------------------------------------------

Функция ВКМ_ПолучитьСтатусИзБазы()



Если ЭтоНовый() Тогда

Возврат Неопределено;

КонецЕсли;



Запрос = Новый Запрос;

Запрос.Текст =

"ВЫБРАТЬ

| Заявка.ВКМ_Статус КАК Статус

|ИЗ

| Документ.ВКМ_ЗаявкаКлиента КАК Заявка

|ГДЕ

| Заявка.Ссылка = &Ссылка";



Запрос.УстановитьПараметр("Ссылка", Ссылка);



Выборка = Запрос.Выполнить().Выбрать();

Если Выборка.Следующий() Тогда

Возврат Выборка.Статус;

КонецЕсли;



Возврат Неопределено;



КонецФункции



// ------------------------------------------------

// Записать строку в регистр истории статусов

// ------------------------------------------------

Процедура ВКМ_ЗаписатьИсториюСтатуса(Статус, Комментарий = "")



Набор = РегистрыСведений.ВКМ_ИсторияСтатусовЗаявок.СоздатьНаборЗаписей();



Запись = Набор.Добавить();

Запись.ВКМ_Заявка = Ссылка;

Запись.ВКМ_Статус = Статус;

Запись.ВКМ_Ответственный = ВКМ_Ответственный;

Запись.ВКМ_ДатаСобытия = ТекущаяДата();

Запись.ВКМ_Комментарий = Комментарий;



Набор.Записать();



КонецПроцедуры



#КонецОбласти
